#+title: music.enigmacurry.com
#+author: EnigmaCurry
#+OPTIONS: ^:{}
#+EXPORT_FILE_NAME: index.html
#+INCLUDE: "~/git/vendor/enigmacurry/literate-k3s/meta/export-html.org"

* Create cluster
Prepare an Ubuntu or Debian node, setup SSH so that your workstation can access
the root account with your key file (use =ssh-keygen= and =ssh-copy-id
root@CLUSTER-DOMAIN= to generate and install key).

Run =apt upgrade= and install =curl= on the server :

#+begin_src shell :noweb yes :eval never-export :exports code :results output
cat << EOF | ssh <<CLUSTER_SSH_USER>>@<<CLUSTER>> /bin/bash
apt -qq update && apt -qq upgrade -y && apt install -y curl
EOF
#+end_src

#+RESULTS:
: All packages are up to date.
: 0 upgraded, 0 newly installed, 0 to remove and 0 not upgraded.
: Reading package lists...
: Building dependency tree...
: Reading state information...
: curl is already the newest version (7.68.0-1ubuntu2.4).
: 0 upgraded, 0 newly installed, 0 to remove and 0 not upgraded.

Install [[https://github.com/alexellis/k3sup#readme][k3sup]], then create the cluster:

#+begin_src shell :noweb yes :eval never-export :exports code :results none
set -e
mkdir -p ${HOME}/.kube
k3sup install --host <<CLUSTER>> --user <<CLUSTER_SSH_USER>> \
  --local-path <<KUBE_CONFIG>> --k3s-extra-args '--disable traefik'
#+end_src

 * Wait a minute or two for the cluster to come up.
 * Now test to see if you can connect and output node status:

#+begin_src shell :noweb yes :eval never-export :exports both
kubectl --kubeconfig=<<KUBE_CONFIG>> get nodes
#+end_src

#+RESULTS:
| NAME  | STATUS | ROLES  | AGE   | VERSION      |
| music | Ready  | master | 7m47s | v1.19.7+k3s1 |

